# Cause of Death in Germany | Data Prep

In [4]:
import pandas as pd

## Load Data

In [5]:
df = pd.read_csv('../data/23211-0004.csv', header=[5,6,7,8], skipfooter=4, sep=";", encoding='unicode_escape', engine='python')

In [6]:
df.head()

  Unnamed: 0_level_0                         Unnamed: 1_level_0          Sex  \
  Unnamed: 0_level_1                         Unnamed: 1_level_1         Male
  Unnamed: 0_level_2                         Unnamed: 1_level_2   Age groups
  Unnamed: 0_level_3                         Unnamed: 1_level_3 under 1 year
0               1980                                      Total         6205
1               1980  Certain infectious and parasitic diseases          185
2               1980       Tuberculosis, including its sequelae            -
3               1980                    Meningococcal infection           22
4               1980                            Viral hepatitis            3

                                                                 \


  1 to under 15 years 15 to under 20 years 20 to under 25 years
0                3076                 3965                 4521
1                 115                   24                   18
2                   1                    2                    4
3                  25                    1                    1
4                   6                    2                    3

                                                                  \


  25 to under 30 years 30 to under 35 years 35 to under 40 years
0                 3762                 3721                 6039
1                   28                   25                   66
2                   11                   10                   33
3                    -                    -                    3
4                    -                    2                    2

                        ...                                            \
                        ...               Female
                        ...           Age groups
  40 to under 45 years  ... 45 to under 50 years 50 to under 55 years
0                10964  ...                 6827                10796
1                  121  ...                   69                   74
2                   79  ...                   27                   26
3                    -  ...                    1                    2
4                    4  ...                    1                    4

                                                                  \


  55 to under 60 years 60 to under 65 years 65 to under 70 years
0                18003                18744                44609
1                  141                  117                  232
2                   64                   48                   94
3                    1                    1                    -
4                    8                    5                   14

                                                                  \


  70 to under 75 years 75 to under 80 years 80 to under 85 years
0                74204                99357               101841
1                  345                  411                  380
2                  123                  150                  116
3                    3                    2                    1
4                   16                   14                   11




  85 years and over age unknown
0            100802           5
1               345           -
2                84           -
3                 3           -
4                 4           -

[5 rows x 38 columns]

## Transform Data

**Convert from wide to long format (keep fist two columns as index columns)**

In [7]:
df = df.melt(id_vars=[df.columns[0], df.columns[1]])

In [8]:
df.head(2)

,"(Unnamed: 0_level_0, Unnamed: 0_level_1, Unnamed: 0_level_2, Unnamed: 0_level_3)","(Unnamed: 1_level_0, Unnamed: 1_level_1, Unnamed: 1_level_2, Unnamed: 1_level_3)",variable_0,variable_1,variable_2,variable_3,value
0,1980,Total,Sex,Male,Age groups,under 1 year,6205
1,1980,Certain infectious and parasitic diseases,Sex,Male,Age groups,under 1 year,185

**Remove unnecessary columns (variable_0, variable_2)**

In [9]:
df = df.drop(columns=['variable_0', 'variable_2'])

In [10]:
df.head(2)

,"(Unnamed: 0_level_0, Unnamed: 0_level_1, Unnamed: 0_level_2, Unnamed: 0_level_3)","(Unnamed: 1_level_0, Unnamed: 1_level_1, Unnamed: 1_level_2, Unnamed: 1_level_3)",variable_1,variable_3,value
0,1980,Total,Male,under 1 year,6205
1,1980,Certain infectious and parasitic diseases,Male,under 1 year,185

**Rename columns**

In [11]:
df.columns = ['year', 'cause', 'gender', 'age', 'count']

In [12]:
df.head(2)

   year                                      cause gender           age count
0  1980                                      Total   Male  under 1 year  6205
1  1980  Certain infectious and parasitic diseases   Male  under 1 year   185

## Clean Data

**Remove "total" rows (we will calculate them ourserlfs if needed)**

In [13]:
print("Number of rows with 'Total' as cause: ", len(df[df['cause']=='Total']))

Number of rows with 'Total' as cause:  1404

In [14]:
df = df.drop(df[df['cause']=='Total'].index, axis=0)

In [15]:
print("Number of rows with 'Total' as cause: ", len(df[df['cause']=='Total']))

Number of rows with 'Total' as cause:  0

**Check gender and age for missing values**

In [16]:
df['gender'].unique()

array(['Male', 'Female'], dtype=object)

In [17]:
df['age'].unique()

array(['under 1 year', '1 to under 15 years', '15 to under 20 years',
       '20 to under 25 years', '25 to under 30 years',
       '30 to under 35 years', '35 to under 40 years',
       '40 to under 45 years', '45 to under 50 years',
       '50 to under 55 years', '55 to under 60 years',
       '60 to under 65 years', '65 to under 70 years',
       '70 to under 75 years', '75 to under 80 years',
       '80 to under 85 years', '85 years and over', 'age unknown'],
      dtype=object)

For gender no missing values could be detected. The mssing values for age (coded as 'age unknown') will stay in the dataset for now. However, depending on the use case we might remove them later on.

**Change data types**

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 110916 entries, 1 to 112319
Data columns (total 5 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   year    110916 non-null  int64
 1   cause   110916 non-null  object
 2   gender  110916 non-null  object
 3   age     110916 non-null  object
 4   count   110916 non-null  object
dtypes: int64(1), object(4)
memory usage: 5.1+ MB

Change count from string to number

In [35]:
df['count'] = pd.to_numeric(df['count'], errors='coerce').fillna(0).astype(int)

In [36]:
df.head(2)

   year                                      cause gender           age  count
1  1980  Certain infectious and parasitic diseases   Male  under 1 year    185
2  1980       Tuberculosis, including its sequelae   Male  under 1 year      0

## Save Data

In [38]:
df.to_csv('../data/cause_of_death_germany_until_2018.csv')